app/controllers/users_controller.rb

SELECT COUNT(*) FROM "users"
---
	def index
		@users = User.order(:username).page(params[:page])#.per(15)

INSERT INTO "users" ("created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  	def create
  		@user = User.new(params[:user])
  	if @user.save

UPDATE "users" SET "last_sign_in_at" = '2013-03-10 18:07:00.310955', "current_sign_in_at" = '2013-03-10 18:07:00.310955', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-03-10 18:07:00.312958' WHERE "users"."id" = 23
---
  def update
    if @user.update_attributes(params[:user])